[
  "dataview",
  "table-editor-obsidian",
  "obsidian-style-settings",
  "better-word-count",
  "obsidian-importer",
  "nldates-obsidian",
  "url-into-selection",
  "obsidian-full-calendar",
  "obsidian-plugin-toc",
  "obsidian-plugin-update-tracker",
  "obsidian-reading-time",
  "obsidian-import-json",
  "janitor",
  "python-lab-plugin",
  "code-emitter",
  "floccus-bookmarks-to-markdown",
  "python-scripter",
  "gnome-terminal-loader",
  "canvasblocks",
  "interactivity",
  "obsidian-task-archiver",
  "3d-graph-new",
  "chord-sheets",
  "obsidian-jtab",
  "vextab",
  "auto-moc",
  "google-keep-import",
  "markdown-chords",
  "guitar-chord",
  "remotely-save",
  "birthday-tracker",
  "obsidian-checklist-plugin",
  "obsidian-reminder-plugin"
]