###################################################################################

#   Удаление пар "ключ-значение"

print("\n")
alien_0 = {'color': 'green', 'points': 5}
print(alien_0)

del alien_0['points']                       # удаление пары
print(alien_0)

#---------------------------------------------------------------------------------#
#                       Отменить удаление пары уже не удасться                    #
#---------------------------------------------------------------------------------#