###################################################################################


#   Обращение к значениям методом get()

#---------------------------------------------------------------------------------#
#      Недостаток [] - Если запрашивать несуществующий обьект, будет ошибка       #
#---------------------------------------------------------------------------------#

print("\n")
# Заполняем словарь
alien_0 = {'color': 'green', 'speed': 'slow'}
# определяем обьект для вывода методом get, если такого обьекта нет в словаре 
point_value = alien_0.get('points', 'No point value assigned.') # будет выведено сообщение 
print(point_value)

#---------------------------------------------------------------------------------#
#     Если в get второй аргумент опущен, бедет возвращаться значение None         #
#---------------------------------------------------------------------------------#