

#############################################################################################

# continue и продолжение цикла

#----------------------------------------------------------------------#
#       continue - возвращение обратно к циклу и проверке условий      #
#----------------------------------------------------------------------#


current_number = 0                          # присваиваем значение 0
while current_number < 10:                  # выполняем цикл при условии, пока current_number меньше 10
    current_number += 1                     # Прибавляем единицу (current_number = current_number + 1)
    if current_number % 2 == 0:             # Проверяем остаток от деления current_number на 2
        continue                            # если остаток = 0 возвращаемся к началу цикла

    print(current_number)                   # Если счетчик не делиться на 2 выполняется остаток кода

# task: pizza

#pizza = []
#topping = ['оливки', 'курица', 'двойной сыр', 'грибы']
mess = "Введите какой топпинг добавить"
while True:
    pizz = input(mess)
    if pizz == 'quit':
        break
    else:
        print(f"Вы добавили {pizz}")
    
