#######################################################################
# ФУНКЦИИ
# Хранение функций в модулях
#---------------------------------------------------------------------#
#      Импотирование вегох модулей                                    #
#---------------------------------------------------------------------#

#=======================================#
#  Блок с модулем функции в файле pizza #
#
#def make_pizza(size, *toppings):
#    """Выводит описание пиццы."""
#    print(f"\nПицца {size}-см. ")
#    for topping in toppings:
#        print(f"- {topping}")          #
#========================================



import pizza # копируем все функции из файла pizza.py

pizza.make_pizza(16, 'пеперони') # вызываем функцию из модуля
pizza.make_pizza(12, 'грибы') # вызываем функцию из модуля

#######################################################################

#---------------------------------------------------------------------#
# Для копирования вего модуля исползуем формат                        #
# from имя_модуля import имя фукции                                   #
#---------------------------------------------------------------------#

from pizza import make_pizza

make_pizza(12, 'двойной сыр')

#######################################################################

#---------------------------------------------------------------------#
#   Псевдоним функции                                                 #
#---------------------------------------------------------------------#

from pizza import make_pizza as mp # назначаем псевдоним для make_pizza

mp(30, 'Грибы')
mp(25, 'Ананас')

#######################################################################

#---------------------------------------------------------------------#
#   Имортирование всех функций модуля                                 #
#---------------------------------------------------------------------#

from pizza import *

mp(30, 'Курица')
mp(25, 'Бекон')



