#######################################################################

# input() - приостановит программу и будет ожидать ввода пользователя

massage = input("\nЗдесь походу обращение к пользователю: ")
print("\n" + massage)

#----------------------------------------------------------------------#
#     Использование полученое с помощью input() числового значения     #
#     приведет к ошибке. input возьмет строку а не значение            #
#     для преобразования строки в число используем int                 #
#----------------------------------------------------------------------#




