#############################################################################################
# ФУНКЦИИ
#-------------------------------------------------------------------------------#
#         Функции - Блок кода выделеный для решения определенной задачи.        #
#       Чтобы выполнить эту задачу - вызываем соответствующую функцию           #
#-------------------------------------------------------------------------------#

def greet_user(): # def определяет функцию с именем greet_user без описания информации в (скобках)
    """Выводит простое приветсвие""" # Коментарий-описание функции
    print("Hello") # тело функции - выводим текст

greet_user() # вызываем функцию
