#############################################################################################
# ФУНКЦИИ
# Значение по умолчанию

def desctible_pet( pet_name, animal_type = 'Собака'): #  Параметр задан по умолчанию
    """Выводит информацию о животных"""        #----------------------------------------------------------#
    print(f"\n У меня есть {animal_type}.")    # Значения по умолчанию должны идти после обычных значений #
    print(f"по имени {pet_name.title()}")      #----------------------------------------------------------#

desctible_pet(pet_name= 'Гендальф') # Аргумент animal_type задавать не нужно
desctible_pet('Фродо')